mdhardenburgh/Blinky/Packages/.cache/NXP.MK66F18_DFP.12.0.0.pdsc
    <condition id="device.MK66F18_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MK66F18_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.i2c_AND_driver.port_AND_driver.rtc_AND_driver.smc_AND_driver.uart_AND_utility.debug_console">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MK66F18_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.dmamux_AND_driver.edma">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.common">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.codec_AND_driver.dialog7212">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.common_AND_driver.i2c">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.common_AND_driver.lptmr">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
    </condition>
    <condition id="device.MK66F18_AND_component.lists_AND_driver.common">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="driver.lpuart_OR_driver.uart">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.lpuart_OR_driver.uart">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require condition="driver.lpuart_OR_driver.uart"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.common_AND_driver.uart">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK66F18_AND_CMSIS_Include_core_cm4">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.MK66F18_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.dspi_edma">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK66F18_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.i2c_edma">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK66F18_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.lpuart_edma">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK66F18_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.uart_edma">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK66F18_AND_device.MK66F18_CMSIS_AND_driver.clock">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MK66F18_startup"/>
    </condition>
