mdhardenburgh/Blinky/Packages/.cache/NXP.MK66F18_DFP.12.0.0.pdsc
    <condition id="device.MK66F18_AND_component.codec_i2c_AND_driver.common">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.dspi_AND_driver.edma">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.common_AND_driver.dmamux">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK66F18_AND_CMSIS_Driver_Include.I2C">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.edma_AND_driver.i2c">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.edma_AND_driver.lpuart">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.enet">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="enet"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.edma_AND_driver.sai">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
    </condition>
    <condition id="device.MK66F18_AND_driver.edma_AND_driver.uart">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK66F18_AND_utility.debug_console">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MK66F18_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK66F18_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="MK66FN2M0???18*" Dvendor="NXP:11"/>
      <accept Dname="MK66FX1M0???18*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MK66F18" Cversion="1.0.0" condition="device.MK66F18_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MK66F18_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.i2c_AND_driver.port_AND_driver.rtc_AND_driver.smc_AND_driver.uart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.MK66F18_AND_driver.dmamux_AND_driver.edma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c" Cversion="2.1.0" condition="device.MK66F18_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/codec/i2c/fsl_codec_i2c.c"/>
        <file category="header" name="components/codec/i2c/fsl_codec_i2c.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="da7212_adapter" Cversion="2.1.0" condition="device.MK66F18_AND_driver.codec_AND_driver.dialog7212">
      <description/>
      <files>
        <file category="sourceC" name="components/codec/port/da7212/fsl_codec_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter" Cversion="1.0.0" condition="device.MK66F18_AND_driver.common_AND_driver.i2c">
      <description/>
      <files>
        <file category="header" name="components/i2c/i2c.h"/>
        <file category="sourceC" name="components/i2c/i2c_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.MK66F18_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
